Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 最后他只好将之前放进去的肉重新拿出来，结果凌霄还没吃够，抢走了他一半。
en_us: In the end, he could only take out the meat that he had just stored away. It turned out that Ling Xiao still had not had his fill and he had even snatched half of his food.

source: 最后他找到一间比较隐蔽的石室，石室空荡荡的，不过地面有些痕迹，似乎曾经有什么东西放在这里，不过被人搬走了，那些人还真是什么都不放过，连桌子柜子都不放过。
en_us: Finally, he found a stone room that was more concealed. It was empty, but there were some traces on the ground. It seemed that something had been put here, before it had been carried away. Those people really did not let anything go, even the table and cabinet had been carried away.

source: 最后当然是没能逃过一劫，好在凌霄只是褪了他的裤子并且只做了一次，一开始他还以为凌霄不过是想逞兽欲而已，后面当他识海里的齐彩团运转起来，他才发现凌霄是真的想跟他修炼……才怪，他敢保证，修炼只是其次，逞兽欲才是目的。
en_us: In the end, of course, he was unable to escape. Fortunately, Ling Xiao just pulled off his trousers and did it once. At first, he thought that Ling Xiao just wanted to slake his lust, but when he felt the colors in his sea of consciousness begin to spin, he found that Ling Xiao really did want to cultivate with him ... As if. He dared to bet that cultivation was only second to the primary motive: lust.

source: 最后得出非去不可的结论。
en_us: Finally, they reached the conclusion that they had to go, no matter what.

source: 最后是麒麟族，不凑巧，也是熟人。
en_us: Then there was the Qilin Clan. Coincidentally, there wer also familiar faces.

source: 最后游小默还是累倒在凌霄怀里，那动作和力道分明就是要把那一阵子没做的都攒在这一次，他身体条件再怎会好也经不起那样的折磨，等他醒过来已经日上三竿了。
en_us: In the end, You XiaoMo still laid tiredly in Ling Xiao's embrace. The movement and the force, was as if unleashing everything that had been saved up for a while. No matter how good was his physical condition, it wasn't able to take something like this. By the time he woke up, the sun was completely up. (日上三竿)

source: 最后由最强的黑熊胜出，所以在自然城的人都知道，某某酒楼的老板娘是黑熊的女人，黑熊很宝贝这个女人，有什么要求都会应允她，所以没人敢得罪她。
en_us: In the end, Black Bear was the one who won, so everyone in Ziran City knew that a certain owner of a certain tavern was Black Bear's woman. Black Bear really treasured this woman, and gave her everything she asked for. Thus, no one dared get on her bad side.

source: 最后相中的那一家，本来想跟对方交换，结果对方却一副‘你得罪了杨导师，我不想跟你兑换’的表情，他回去看那位杨导师，对方给了他一对挑衅的眼神。
en_us: He had intended to exchange with the last shop he picked, yet the other had an expression of 'you offended Teacher Yang, I don't want to exchange with you'. When he went back to see that Teacher Yang, the other party gave him a provocative stare.

source: 最后问了这层楼的负责人后才知道，一千万灵晶只是空间符的价值，而这个价格确实是很多人拿不出来的，所以这里并不局限于灵晶的交易，以物易物更常见。
en_us: In the end, he found out from asking the one in charge of this floor that ten million spirit gems was just the value of the teleportation talisman, and this was a value that many were unable to afford. That was why this place wasn't limited to transactions done in spirit gems. Trading different items wasn't uncommon.

source: 最后，八个人跑得只剩下天刀和天修，两个面瘫还算镇定，就是不知道心里怎么想的。
en_us: In the end, only Tian Xiu and Tian Dao remained of the eight. The two stoics seemed calm, but no one knew what they were thinking inside.

source: 最后，变成光棍司令的黄鼠兽挥泪告别他可爱的手下们。
en_us: Finally, the Weasel Beast that had become the commander of those ruffians wiped away tears as it bid farewell to its adorable underlings.

source: 最后，我不喜欢吃别人炼的灵丹。”
en_us: Lastly, I don't like to eat magic pills refined by other people."

source: 最后，游小默花了一枚九级灵丹换到了黑玉。
en_us: In the end, You XiaoMo exchanged a level nine pill for the black jade.

source: 最后，游小默还是没给小乌龟取名，主要是没有好名字，所以就一直小乌龟小乌龟的叫，就像小鸡一样，他都快忘了给小鸡取的名字，好像也是凌霄取的，叫什么混球来着？
en_us: Finally, You XiaoMo still did not give a name to the little tortoise, mainly because he did not have any good names. Therefore, he kept calling it little tortoise, little tortoise, just like the chick. He had almost forgotten the name given to the chick. It seemed that Ling Xiao was the one to help name it and it seemed to be called something along the lines of HunQiu?

source: 最终，游小默听出凌霄话里带着一丝急切，也懒得跟他计较了，立刻把情况告诉他，他确实找到水元素之心了，但是这枚元素之心的灵智比他见过的任何一枚都要高，滑溜得像条泥鳅。
en_us: You XiaoMo noticed the hint of anxiety in Ling Xiao's voice and didn't bother retorting. He immediately reported his current situation. he had found the water elemental essence, but this elemental essence's spiritual awareness exceeded any other he had seen before, and it was as slippery as an eel.

source: 最终，游小默被凌霄找了个安全有禁制的洞府塞进去。
en_us: Finally, Ling Xiao looked for a safe Immortal's cave that had a restriction and stuffed You XiaoMo inside.

source: 最苦逼的是游君其，他总觉得他的工作是最辛苦的，果然有了夫君就不要爹，这句话说得没错。
en_us: The one who had it the most miserable (苦逼) was You JunQi. He always felt that his work was the most laborious. Sure enough, this sentence of 'A father is not needed if there's a husband' (有了夫君就不要爹) was right.

source: 最让他感到愤愤然的是，他一共就得到两张地图，结果两张都有问题，难道所谓地图不是应该直接把地点标出来，好让他轻松的找到东西吗？
en_us: The thing that made him the most angry was that he had only received two maps in total, but both maps had problems. Shouldn't a so-called map directly indicate where the location was, so he could effortlessly find what he was looking for?

source: 最近一直在外袍，空间符越用越没节制。
en_us: Recently, they always been running up and down outside, and it felt as if the usage of the teleportation talisman was becoming more intemperate the more it was used.

source: 最近，他甚至听说妖凰族找回了许多年前失散在外的族人，那个族人和他们是同一辈的，虽然发育得比较慢，但是据说他的天赋极其出色，甚至还在姬凤之上。
en_us: Recently, he had even heard that the Demon Phoenix Clan had found a clansman that had been long-lost/missing for many years on the outside. That clansman was the same generation as them. Though his development was slower, but it was rumored that his innate talent was extremely outstanding, and was even higher than Ji Feng.

source: 最近，因为游小默和凌霄与赤血家族闹翻，他俩回逍遥院的可能性已经不大，而且现在的局势有些紧张，想从游小默和凌霄口中打听到他想要的内容几乎不可能。
en_us: Recently, because You XiaoMo and Ling Xiao had a falling out with the Vermillion Blood Clan, the likelihood that the two of them would return to XiaoYao Institution wasn't very high. Moreover, the situation right now was a little tense, and it was essentially impossible for him to pry the information he needed out of You XiaoMo and Ling Xiao's mouths.

source: 最震怒的莫过于将所有希望都放在姬云琅身上的姬赫。
en_us: Nothing could surpass the anger of Ji He who had placed all his hopes on Ji YunLang.

source: 月光洒在洞口，夜明珠照亮了躺在石床上的两人。
en_us: The moonlight spilled into the entrance of the cave as the Night Pearl illuminated the two people lying on the stone bed.

source: 有一次他在彻底认主空间的时候，他额头上的族纹就隐约出现过，之后又出现过一次，但他本人看不到，所以才一直没有发现。
en_us: The clan mark on his forehead faintly appeared once when he was fully acknowledged (彻底认主) as the master of the dimension. It appeared once more after that, but he had never discovered it because he could not see it on himself.

source: 有一种打架方式比群殴更好玩！
en_us: There was a style of fighting that was even more fun than wild brawls!

source: 有一道极其刺眼的视线让他怎么也忽视不了。
en_us: There was a blinding gaze on him that he couldn't ignore.

source: 有个厉害的男人宠着，老板娘不嚣张谁还能嚣张，不过也有人买账才行。
en_us: With a very powerful man's backing, if the owner couldn't be so confident, then who could?

source: 有了空间符，加上黄鼠兽派手下收集的地图，他们很快便走出大通海，再次出现在洞域。
en_us: With the teleportation talismans and the maps collected by the Weasel Beast's subordinates, they soon emerged from the DaTong Sea and reappeared in Dong Yu.

source: 有些人亲眼看到莫雪被烧的人不人鬼不鬼的脸，被吓的一夜睡不着觉，一闭上眼就想起他的脸，怪恐怖的。
en_us: Some people had seen Mo Xue's face with their own eyes, which was burned so badly it didn't look like a human or demon. They were so scared that they couldn't sleep the entire night, and as soon as they closed their eyes they would remember her face. It was quite terrifying.

source: 有些人对灵酒本身或许不是很感兴趣，但是若能得到它的配方，就意味着以后可以经常酿这种灵酒。
en_us: Some weren't interested in the wine itself, but if they could have the recipe, then that would mean they could brew it regularly.

source: 有些人就是冲着这枚十二阶内丹来的。
en_us: Some people had come just for the level twelve Life Crystal.

source: 有些人甚至直接踩在守卫的身体冲出去，变得比菜市场还要混乱，尖叫声，怒骂声，狂笑声等等。
en_us: Some people even trampled over the bodies of the guards. The entire situation was even more chaotic than a marketplace, screaming, cursing, wild laughter.

source: 有些人的容貌毁了可以用灵丹恢复，但是有些就不可以。
en_us: There were some people who were disfigured who could use magic pills to recover, but there were also some that couldn't.

source: 有些人观察了游小默的表情，他一脸诧异，顿时猜想可能他自己都不知道他的同伴竟然会出手。
en_us: Some people were observing You XiaoMo's expression. He looked shocked and they guessed that even he didn't know that his companion would bid.

source: 有些财大气粗，腰缠万贯的人，他们或许没有灵晶，可身上的灵药却价值连城，随便拿出一样说不定就超过一千万灵晶了。
en_us: Some extremely wealthy people might not have spirit gems, but the magic herbs they had on them was worth cities. Any one of them might be over ten million in value.

source: 有些院生正是想到积分带给他们的好处，所以他们多半是愿意被坑的，很多人早已见怪不怪，而且对方是导师长老，跟他争辩，不给他面子反而会得罪他。
en_us: Other students just thought of the benefits that the points would bring them, so they were mostly willing to be ripped off. Many had long become inured to the unusual and the other party was an Elder Teacher (导师长老). Disputing with him and not giving him any face would only offend him.

source: 有人欢喜，有人忧。
en_us: Some were happy and some were worried.

source: 有人说黑熊是想找出那日打败他的人，也有人说是在抓小偷，好像是黑熊丢失了什么重要的东西。
en_us: Some said that Hei Xiong was trying to find the person who beat him that day, others said it was for catching thieves, as it seemed that Hei Xiong had lost something important.

source: 有人起头，其他人自然不会留下来丢脸，纷纷找借口偷溜了。
en_us: With someone setting an example, the others naturally wouldn't stay and be humiliated, all finding excuses to run off.

source: 有什么好担心的，该知道的他都知道的一清二楚，不知道的等凌霄回来问他不就知道了。
en_us: What was there to be worried about? He was already crystal clear about the matters that he should know about. As for those that he did not know, it would be revealed just by asking Ling Xiao when he came back.

source: 有什么影像从他脑海里一闪而过，模糊的身影越来越清晰，刑七没有立刻去理清，下意识追着少年的身影而去。
en_us: Something flashed across his mind and the blurry figure became clearer, but Xing Qi didn't have time to organize his thoughts as he followed the man subconciously.

source: 有他亲自出马，吞金兽和金翅虫的行踪很快就被发现了，不管他们跑到哪都有守卫追上来，幸好她们有先天优势，这才一次又一次躲过围剿。
en_us: The Metal Swallowing Beast and the Golden Winged Insect were quickly discovered with him personally setting out. There would be guards chasing after them no matter where they ran. Fortunately, they had inborn advantages (先天优势) and were able to avoid the encirclement (围剿) time and time again.

source: 有冤大头不宰是笨蛋！
en_us: If you didn't rip off a spendthrift, then you're an idiot!

source: 有几波人眼睛已经喷火了。
en_us: Flames were already shooting out of the eyes of several groups of people.

source: 有的是一颗十一阶妖兽的内丹，有的是一株顶级灵草，有的甚至是顶级丹，要灵丹的大概是自己的实力不够，又或者没有材料自己炼丹等等。
en_us: Some wanted the life crystal of a level eleven demon beast. Some wanted transcendent level magic herbs, and some even wanted transcendent level pills. Those who wanted the pills probably didn't have the ability or maybe the materials to refine the pills themselves.

source: 有这两大强者，在外人看来，凌霄根本就没有希望。
en_us: With these two powerhouses, it seemed to most that Ling Xiao had no hope of winning.

source: 有道理！
en_us: That's reasonable!

source: 望着游小默及他的炉鼎，台下顿时响起一阵阵惊哗之声。
en_us: Gazing at You XiaoMo’s cauldron, murmurs of shock travelled through the audience

source: 望着静静悬浮在炉鼎里的灵草液体，游小默终于松了一口气，用袖子擦擦额头上的汗水。
en_us: Staring at the magic herb liquid, which was quietly floating in the cauldron, You XiaoMo finally let out a sigh of relief and wiped his forehead from sweat.

source: 木屋内，银戈看着朝思暮想的人在分别许久后终于再度出现在他面前，他本就不是个善于表达内心情感的人，心中的激动在这一刻反而平静了下来。
en_us: Inside the wooden house, Yin Ge gazed at the person he had been yearning for day and night. Feng ChiYun had finally appeared in front of him after they had been separated for ages. He was not a person who was good at expressing his inner feelings, but on the contrary, the excitement in his heart calmed down at this moment.

source: 未免节外生枝，双方很爽快的进行了交易。
en_us: In order to avoid new issues cropping up, the two sides soon began the transaction.

source: 未等他们走进巨无霸，大门突然跑出来几个人，正是乔无双他们几个人，游小默和凌霄从逍遥院的大门走到这边还不到十个小时，他们就收到消息，这速度也够快的。
en_us: Before they entered the Giganticus, suddenly out came a few people and they were, of course, Qiao WuShuang and the others. It wasn't even ten hours since Ling Xiao and You XiaoMo entered the XiaoYao Institution. For them to have heard the news, that was some speed.

source: 未等众人反应过来，一直沉默不语的天修“嚯”地一下就站了起来，脸色突然变得十分难看。
en_us: Without waiting for everyone to respond, Tian Xiu, who had been silent up until now, suddenly stood up with a noise of surprise. His expression turned extremely ugly.

source: 本以为没戏了，但是当游小默听到最后一句话的时候，他又觉得有戏了。
en_us: You XiaoMo originally thought it was hopeless, but when he heard that last sentence, he suddenly felt hopeful again.

source: 本想循序渐进的培养灵草田的灵草，毕竟灵水珍贵，不能随意浪费，因为一天浇太多次灵水，灵草无法一次性吸收就会导致部分灵水浪费了。
en_us: Originally, he wanted to nurture the magic herbs in the magic herb field (灵草田) step by step. After all, spiritual water was precious, and he couldn't just casually waste it. Because he had watered them too many times in one day, if the magic herbs couldn't absorb it in one go, then it would lead to part of the spiritual water being wasted.

source: 本来一切都好好的，没人知道他在地下迷宫里，只需要一点点时间，他就能逃出宫殿与凌霄回合，结果没想到会发生意外。
en_us: Originally, everything was fine. Nobody knew that he was in the underground labyrinth (迷宫), and he just needed a tiny bit of time so he could escape from the palace and meet with Ling Xiao, but he hadn't expected that such an accident would occur.

source: 本来他们并没有打算杀了刑七，但是男人一句‘他的内丹应该不错’就定下了他的生死，于是才有了这一幕。
en_us: At first, they hadn't planned on killing Xing Qi, but with the man's 'his (内丹) should be pretty good', Xing Qi's life was determined. Thus, the scene from before.

source: 本来他们是打算在乌山集镇找家酒楼暂时住下，但是游小默又纠结怎么赚灵晶，他身上只剩下五六百万灵晶，这个数目肯定是不够的，因为一株顶级灵草少说也要一千多万。
en_us: Originally they wanted to find an inn to stay at temporarily in WuShan Town, but You XiaoMo was struggling again with how to earn spirit gems. He only had five or six million spirit gems left on him, which definitely wasn't enough, since a transcendent level magic herb was at least ten million.

source: 本来以他们缓慢的飞行速度确实需要一个小时，但是加速后却连半个小时都不需要了。
en_us: Originally, with their slow flying speed, it would have indeed taken them an hour. But after adding on the speed, they didn't even need half an hour.

source: 本来在巨无霸里炼丹是最好的选择，因为巨无霸上面据说有禁制保护，如果有雷云降临，可利用禁制抵挡，但太过频繁的话还是会引起注意。
en_us: Originally, the best choice was to refine pills in the Giganticus because it was rumored that the Giganticus was protected by restriction barriers. If Tribulation Lightning (雷云降临) came, the restriction barriers could be used to ward it off, but it would cause too much attention if it happened too frequently.

source: 本来就已经与麒麟族关系不好，再加上一个通灵玄龟那就不好玩了。
en_us: Their relationship with the Qilin Clan wasn't that good in the first place, and if they added on the Psychic Black Turtle, then that wouldn't be very fun.

source: 本来游小默的空间是可以移动的，但在这里却用不得，因为这里守护者两名神强者，以他的实力还做不到不被发现，实力越高的强者，对空间就越敏感。
en_us: Originally, You XiaoMo's dimension could move, but he couln't do that here because there were two Divine level powerhouses guarding this area. At his level, he couldn't move around without being noticed. The stronger the practitioner, the more sensitive they were to sensing dimensions.

source: 本来确实如此，可是就在罡风被弹开的瞬间，中间突然‘噗嗤’的冒出零星火花，接着‘嚯’的一声，火花像被点燃似的变大，一瞬间缠上黑熊的手臂……
en_us: That should have been the case, but just as the (罡风) bounced off, sparks abrutly bursted out from the middle and what a bang, the sparks, as if ignited, spreaded. In an instant, Hei Xiong's arm caught on fire...

source: 杀死莫菲后，小秋将她身上的伤口做了些掩饰，然后又在自己身上制造一些伤口，看起来跟别人死命搏斗过，这才赶回小镇。
en_us: After killing Mo Fei, she covered some of her wounds and made some more on her own body, as if she had just fought to the death with someone, before heading back to the town.

source: 杀游安泰，杀游明，杀四站神之一的游向东，闯进本家放走禁地许多凶恶的囚犯，还有破坏玉仙城种种罪行，每一项都令人震惊不已，不出一天就以龙卷风之势席卷了通天大陆。
en_us: His multiple crimes included killing You AnTai, killing You Ming, killing one of the four Battle Gods (站神) You XiangDong, barging into his own clan's forbidden zone and releasing numerous ferocious prisoners, and destroying Yu Xian City. Each act endlessly shocked people, and not even a day had passed before it swept across TongTian Continent like a tornado.

source: 李管事假意为难了一下，终于点头答应了。
en_us: Manager Li pretended to be troubled for a second before finally nodding in agreement.

source: 李管事拍拍胸口保证一定会第一时间通知他，然后笑容满面的将他送出灵草堂。
en_us: Manager Li patted his chest and promised that he would notify him at the first moment, before he suddenly sent him out of the Magic Herb Shop with all smiles.

source: 李管事无奈的回道：“公子的运气可以说好也可以说不好，黑莲草我们这里确实没有，但是心灵花草却刚好有一株，只是这一株已经被人给预定了。”
en_us: Manager Li answered helplessly, "Young master's luck can be considered both good and bad. We indeed do not have the Black Lotus Herb here, but we just received one Heart Flower Herb. The only thing is that it was reserved by someone."

source: 李管事早料到张管事不会那么轻易就告诉他，肯定会提起心灵花草一事，于是他假装对他‘晓之以情，动之以理’，然后又把灵草堂拿出来当挡箭牌，最后表示他会亲自上门去跟苏朗说明情况，从他口中套出苏朗的住址。
en_us: Manager Li had long since guessed that Manager Zhang wouldn't tell him so easily, and that he would definitely bring up the matter about the Heart Flower Herb. Therefore, he pretended to be 'touched by emotion' and 'willing to act reasonably,' before bringing up the Magic Herb Shop again as a shield. Finally, he expressed that he would personally go and clear things up with Su Lang before fishing out Su Lang's address from him.

source: 李管事犹豫了，一千万灵晶对古玛部落来说已经是一大笔灵晶，因为他们的总资产加起来不过几亿。
en_us: Manager Li hesitated. Ten million spirit gems was already a large sum of money for the Guma Tribe, since all of their assets added together wasn't over a couple hundred million.

source: 李管事皮笑肉不笑的扯了下脸上的肉，听到他的话连忙谦卑的说道：“公子，实在是对不住了，我这伙计是新来的，我让他看着这段时间进的灵草，结果他误把其他灵草当成心灵花草了。”
en_us: Manager Li put on a forced smile, and when he heard him speak he hurried to say humbly, "Young master, I have truly been unfair to you. This assistant of mine is new, and I told him to look out for the magic herbs that have been coming in, but he accidentally thought another magic herb was the Heart Flower Herb."

source: 李管事解释道：“公子，事情是这样的，前些天有个人和你们一样也是来找心灵花草，不过那时灵草堂还没有这株灵草，他便让我们帮忙留意，如果有便通知他，这株灵草也是早上才刚运来的，小人正准备派人去通知那个人。”
en_us: Manager Li explained, "Young master, the situation is like this. Several days ago, someone came to look for the Heart Flower Herb just like you two. However, the Magic Herb Shop didn't yet have the Heart Flower Herb, so he asked us to keep an eye out. If we found one, then we should notify him. This magic herb was just shipped over this morning, and I was just preparing to send someone over to go notify him."

source: 李管事连忙陪笑，当灵草堂顶级区的管事已经几十年，什么大风大浪没见过，脸上的表情已经能很好的控制住，不过伙计就不一定了。
en_us: Manager Li hastily put on a smile. He had already been the manager of the Magic Herb Shop for many years now, and he had seen countless adverse situations. He could control the expression on his face extremely well by now, but it was not necessarily the same for the assistant.

source: 李管事顿了两秒，突然面露难色。
en_us: Manager Li paused for a few seconds before suddenly hesitating.

source: 村民们已经被他的话说得懵了。
en_us: The villagers were already struck dumb by him words.

source: 村民们顿时面面相觑。
en_us: The immediately looked at each other.

source: 村长倒吸了一口冷气，踏平？
en_us: The village head sucked in a breath, trample?

source: 村长心意一动，“愿闻其详。”
en_us: The village head was moved, "Please, tell me more."

source: 村长是一个四五十岁的中年人，看起来很憨厚，他代表大家走了出去，毕恭毕敬的走到游小默面前。
en_us: The village head was a middle aged man of about forty or fifty and had an honest, straightforwards look about him, walking towards You XiaoMo respectfully.

source: 村长虽然对游小默“高价收购”四字很动心，但他更多的是考虑到胡村的安危，他们只是一介凡人，斗不过清风门。
en_us: Though the village head was tempted by You XiaoMo's "but it all at a high price", he was more worried about the safety of the people in Hu Village. They were only normal people and couldn't fight the QingFeng Sect.

source: 来人正是游小默，手上正端着自己用完的盘子碗筷，没想到刚好撞见这一幕，眼睛不禁闪过一丝诧异。
en_us: The one who came was You XiaoMo, who carried his finished plates and chopsticks. Coincedently he saw this scene and a look of surprise flashed across his face.

source: 来者正是刑七，高殷并没有跟他一起过来。
en_us: The one who came was Xing Qi, but Gao Yan wasn't with him.

source: 来者的声音像是被掐住喉咙一样沙哑低沉，全身笼罩在黑色的斗篷下面，只余下一双阴森森的眼睛，正面无表情的盯着受惊的黑熊。
en_us: The newcomer's voice was hoarse and low as if he had been choked. His entire body was shrouded underneath his black cloak, leaving only a pair of gloomy eyes, and he was staring expressionlessly at the startled Hei Xiong.

source: 杨丁三人脸色一变。
en_us: The expression on they're faces changed.

source: 杨丁上下打量了游小默一遍，不客气的问道，他们看不出游小默的修为，但是他们已经先入为主，所以不觉得他有多厉害。
en_us: Yang Ding said unwelcomingly as he looked at You XiaoMo from head to toe. They couldn't tell You XiaoMo's level but with the knowledge they had, they already placed You XiaoMo into the 'non-threatening' category.

source: 杨丁却以为他嫌两枚灵晶太少，又加了三枚，用不耐烦的语气说道：“我给你五枚灵晶，现在总可以了吧。”
en_us: Thinking he thought two spirit gems was too little, Yang Ding added three more and said with impatience, "I'll give you five, now that should be enough."

source: 杨丁和王华完全愣住了，十几秒后才反应过来，两人对视一眼，都从对方的眼中看到了愤怒和杀意，他们以为游小默运气好误打误撞才踢中赵二，两人毫不含糊的联手，一左一右欲致游小默于死地。
en_us: Yang Ding and Wang Hua was completely dumbfounded and it two them a few seconds before they came to their senses. The two looked at each other and both could see the anger as well as killing intent flaring. They thought that You XiaoMo had only been able to kick Zhao Er by accident. The two came together, from right and left, in a clear as day fashion to take the killing blow on You XiaoMo. (毫不含糊的联手，一左一右欲致游小默于死地)

source: 杨丁将筷子扔到地上，筷子刚好掉在走进来的万厨师和小助手脚边，冷哼一声，不悦的看着万厨师说道：“你做的这是什么饭菜，怎么这么难吃？”
en_us: Yang Ding threw his chopsticks onto the ground and coincidently it landed right by Chef Wan and his little assistant's feet. He let out a cold snort and said with displeasure to Chef Wan, "What kind of food is this, how is it so disgusting?"

source: 杨丁摸出两枚灵晶扔到桌上，傲慢的说道：“帮我们做一桌好吃的，这两枚灵晶就是你的。”
en_us: Yang Ding got out two spirit gems and threw them on the table. With arrogance he said, "Make us something good and the two spirit gems are yours."

source: 杨丁狐疑的目光落在游小默身上，说起来，昨天他们确实有看到这个小子端着一盘点心回房，而且两次闻到那个香味也都是从他的房间里飘出来的，所以万厨师说的很可能是真的。
en_us: Yang Ding looked suspiciously at You XiaoMo. Looking back, he they did see this boy carring a tray of pastries back to his room and the two times they smelled something nice also came from his room. Therefore what Chef Wan said may very well be the case.

source: 杨丁眯起眼，谅他一个普通凡人也不敢对他说谎，“那你倒是说说，为何这饭菜的味道会和昨天的不一样？”
en_us: Yang Ding squinted his eyes, he didn't think a commoner would dare lie to him and asked, "Then you tell me, why does this food taste different from yesterday's?"

source: 杨导师不慌不忙的说道：“那么你认为积分重要，还是灵晶重要？”言下之意就是吃定他。
en_us: Teacher Yang leisurely replied, "Then what do you think is more important? The points or spirit gems?" The implication of this was that Teacher Yang was out to get him. (言下之意就是吃定他)

source: 杨导师冷笑出声，“小子，你有种，我们走着瞧！”
en_us: Teacher Yang sneered, "Boy, you have guts. We'll wait and see!"

source: 杨导师刚好听到了，忍不住问道：“宫长老，你在笑什么？”
en_us: Teacher Yang happened to hear it and could not refrain from asking, "Elder Gong, what are you laughing about?"

source: 杨导师只觉得脑袋轰地一声嗡了。
en_us: Teacher Yang felt as if his brain had exploded.

source: 杨导师敢漫天开价就是有这份底气，可惜他今天注定倒霉。
en_us: This was the reason why Teacher Yang dared to ask for an exorbitant price. Unfortunately he was destined to run out of luck today.

source: 杨导师突然冷笑一声，“我开二十万灵晶，你却说五万，你以为积分是天上掉下来的不成！”
en_us: Teacher Yang suddenly sneered, "My opening price is two hundred thousand spirit gems, but you say you want it for fifty thousand, do you think that points fall from the sky?!"

source: 杨导师终于反应过来，诚恳的笑道：“我这里只有两积分，如果你都要，我可以算你便宜点，一积分换二十万灵晶。”
en_us: Teacher Yang finally responded and he smiled sincerely, "I only have two points at the moment. I can give you a cheaper rate if you want both. One point for two hundred thousand spirit gems."
